
//!!!!重要
//编译完此bin后，确认下有没有大于这个值，大了务必调整
//ROM空间布局（详见env.c）
//bootRomSize=256k NVRAM_SECSIZE=4k时rom空间分配
//rom空间分配
//---------------------------------------------------------------------------------------------------------------------------
//|	名称	|		luojios.bin位置			|		set配置参数保存位置				|					空余空间							|
//---------------------------------------------------------------------------------------------------------------------------
//|	地址	|		256*1024				|		256*1024-4*1024			|					空余空间							|
//---------------------------------------------------------------------------------------------------------------------------
#define NVRAM_SECSIZE		(4*1024) 	//环境变量空间 4k=4096byte 默认包含在256kB的空间尾部 之所以是4k，是为了环境变量参数重写入flash 最小4k擦除 免得破坏其他数据
#define BOOT_ROM_SIZE 		256 		//单位KB 被4整除即可 编译完此bin后，确认下有没有大于这个值，大了务必调整

#define BUILD_TEST_FUN 0//编译testFun.c内的函数

#define LOCAL_IP		"172.0.0.13"
#define LOCAL_MASK		"255.255.0.0"
#define LOCAL_GATEWY	"172.0.0.1"
#define LOCAL_MAC		"00:55:7B:B5:7D:F7"

#define	ENV_TFTP_SERVER_IP	"172.0.0.11"	//tftp 服务器ip
#define	ENV_TFTP_PMON_FILE	"luojios.bin"	//默认flash的文件名

#define	LOAD_ELF_ADDR_FILE	"tftp://172.0.0.11/rtthread.elf"


